pub const building_number = [_][]const u8{ "#", "##", "###" };

pub const city_name = [_][]const u8{ "Алчевськ", "Артемівськ", "Бердичів", "Бердянськ", "Біла Церква", "Бровари", "Вінниця", "Горлівка", "Дніпродзержинськ", "Дніпропетровськ", "Донецьк", "Євпаторія", "Єнакієве", "Житомир", "Запоріжжя", "Івано-Франківськ", "Ізмаїл", "Кам’янець-Подільський", "Керч", "Київ", "Кіровоград", "Конотоп", "Краматорськ", "Красний Луч", "Кременчук", "Кривий Ріг", "Лисичанськ", "Луганськ", "Луцьк", "Львів", "Макіївка", "Маріуполь", "Мелітополь", "Миколаїв", "Мукачеве", "Нікополь", "Одеса", "Олександрія", "Павлоград", "Полтава", "Рівне", "Севастополь", "Сєвєродонецьк", "Сімферополь", "Слов’янськ", "Суми", "Тернопіль", "Ужгород", "Умань", "Харків", "Херсон", "Хмельницький", "Черкаси", "Чернівці", "Чернігів", "Шостка", "Ялта" };

pub const city_pattern = [_][]const u8{ "{{location.city_name}}", "{{location.city_prefix}} {{person.male_first_name}}" };

pub const city_prefix = [_][]const u8{ "Південний", "Північний", "Східний", "Західний" };

pub const city_suffix = [_][]const u8{"град"};

pub const country = [_][]const u8{ "Австралія", "Австрія", "Азербайджан", "Албанія", "Алжир", "Ангола", "Андорра", "Антигуа і Барбуда", "Аргентина", "Афганістан", "Багамські Острови", "Бангладеш", "Барбадос", "Бахрейн", "Беліз", "Бельгія", "Бенін", "Білорусь", "Болгарія", "Болівія", "Боснія і Герцеговина", "Ботсвана", "Бразилія", "Бруней", "Буркіна-Фасо", "Бурунді", "Бутан", "В’єтнам", "Вануату", "Ватикан", "Велика Британія", "Венесуела", "Вірменія", "Габон", "Гаїті", "Гайана", "Гамбія", "Гана", "Гватемала", "Гвінея", "Гвінея-Бісау", "Гондурас", "Гренада", "Греція", "Грузія", "Данія", "Демократична Республіка Конго", "Джибуті", "Домініка", "Домініканська Республіка", "Еквадор", "Екваторіальна Гвінея", "Еритрея", "Естонія", "Ефіопія", "Єгипет", "Ємен", "Замбія", "Зімбабве", "Ізраїль", "Індія", "Індонезія", "Ірак", "Іран", "Ірландія", "Ісландія", "Іспанія", "Італія", "Йорданія", "Кабо-Верде", "Казахстан", "Камбоджа", "Камерун", "Канада", "Катар", "Кенія", "Киргизстан", "Китай", "Кіпр", "Кірибаті", "Колумбія", "Коморські Острови", "Конго", "Коста-Рика", "Кот-д’Івуар", "Куба", "Кувейт", "Лаос", "Латвія", "Лесото", "Литва", "Ліберія", "Ліван", "Лівія", "Ліхтенштейн", "Люксембург", "Маврикій", "Мавританія", "Мадаґаскар", "Македонія", "Малаві", "Малайзія", "Малі", "Мальдіви", "Мальта", "Марокко", "Маршаллові Острови", "Мексика", "Мозамбік", "Молдова", "Монако", "Монголія", "Намібія", "Науру", "Непал", "Нігер", "Нігерія", "Нідерланди", "Нікарагуа", "Німеччина", "Нова Зеландія", "Норвегія", "Об’єднані Арабські Емірати", "Оман", "Пакистан", "Палау", "Панама", "Папуа-Нова Гвінея", "Парагвай", "Перу", "Південна Корея", "Південний Судан", "Південно-Африканська Республіка", "Північна Корея", "Польща", "Португалія", "Російська Федерація", "Руанда", "Румунія", "Сальвадор", "Самоа", "Сан-Марино", "Сан-Томе і Принсіпі", "Саудівська Аравія", "Свазіленд", "Сейшельські Острови", "Сенеґал", "Сент-Вінсент і Гренадини", "Сент-Кітс і Невіс", "Сент-Люсія", "Сербія", "Сирія", "Сінгапур", "Словаччина", "Словенія", "Соломонові Острови", "Сомалі", "Судан", "Суринам", "Східний Тимор", "США", "Сьєрра-Леоне", "Таджикистан", "Таїланд", "Танзанія", "Того", "Тонга", "Тринідад і Тобаго", "Тувалу", "Туніс", "Туреччина", "Туркменістан", "Уганда", "Угорщина", "Узбекистан", "Україна", "Уругвай", "Федеративні Штати Мікронезії", "Фіджі", "Філіппіни", "Фінляндія", "Франція", "Хорватія", "Центральноафриканська Республіка", "Чад", "Чехія", "Чилі", "Чорногорія", "Швейцарія", "Швеція", "Шрі-Ланка", "Ямайка", "Японія" };

pub const default_country = [_][]const u8{"Україна"};

pub const postcode = [_][]const u8{"#####"};

pub const secondary_address = [_][]const u8{"кв. ###"};

pub const state = [_][]const u8{ "АР Крим", "Вінницька область", "Волинська область", "Дніпропетровська область", "Донецька область", "Житомирська область", "Закарпатська область", "Запорізька область", "Івано-Франківська область", "Київська область", "Кіровоградська область", "Луганська область", "Львівська область", "Миколаївська область", "Одеська область", "Полтавська область", "Рівненська область", "Сумська область", "Тернопільська область", "Харківська область", "Херсонська область", "Хмельницька область", "Черкаська область", "Чернівецька область", "Чернігівська область", "Київ", "Севастополь" };

pub const street_address = .{ .normal = "{{location.street}}, {{location.buildingNumber}}", .full = "{{location.street}}, {{location.buildingNumber}} {{location.secondaryAddress}}" };

pub const street_name = [_][]const u8{ "Зелена", "Молодіжна", "Городоцька", "Стрийська", "Вузька", "Нижанківського", "Староміська", "Ліста", "Вічева", "Брюховичів", "Винників", "Рудного", "Коліївщини" };

pub const street_pattern = [_][]const u8{ "{{location.street_prefix}} {{location.street_name}}", "{{location.street_name}} {{location.street_suffix}}" };

pub const street_prefix = [_][]const u8{ "вул.", "вулиця", "пр.", "проспект", "пл.", "площа", "пров.", "провулок" };

pub const street_suffix = [_][]const u8{"майдан"};
