pub const bear = [_][]const u8{ "大熊猫", "眼镜熊", "太阳熊", "懒熊", "美洲黑熊", "亚洲黑熊", "棕熊", "北极熊" };

pub const cat = [_][]const u8{ "中华田园猫", "中国狸花猫", "山东狮子猫", "玄猫", "黑白花猫", "三花猫", "玳瑁猫", "橘猫", "四川简州猫", "中国大白猫", "美国短毛猫", "英国短毛猫", "加菲猫", "波斯猫", "布偶猫", "苏格兰折耳猫", "暹罗猫", "斯芬克斯猫", "德文卷毛猫", "阿比西尼亚猫" };

pub const dog = [_][]const u8{ "藏獒", "袖狗", "拉萨狮子犬", "西藏狮子犬", "松狮犬", "中国冠毛犬", "西施犬", "沙皮犬", "八哥犬", "西藏獚", "中华田园犬", "下司犬", "北京犬", "西藏梗", "柴犬", "哈士奇", "德国牧羊犬", "边境牧羊犬", "贵兵犬", "秋田犬", "罗威纳犬", "蝴蝶犬", "英国斗牛犬", "阿富汗猎犬", "萨摩耶犬", "大白熊犬", "比利时牧羊犬", "美国爱斯基摩犬", "彭布罗克威尔士柯基犬", "墨西哥无毛犬" };

pub const fish = [_][]const u8{ "草鱼", "鲶鱼", "鳙鱼", "鲤鱼", "金鱼", "胭脂鱼", "中华鲟", "长江白鲟", "新疆大头鱼", "青鱼", "鲫鱼" };

pub const horse = [_][]const u8{ "蒙古马", "伊利马", "三河马", "河曲马" };

pub const @"type" = [_][]const u8{ "熊", "猫", "狗", "鱼", "马" };
