pub const bear = [_][]const u8{ "پانڈا", "بھالو", "امریکی کالا بھالو", "ایشیایٰ کالا بھالو", "بھورا بھالو" };

pub const cow = [_][]const u8{ "گائے", "نیلی گاٗیے", "امریکی گاٗیے" };

pub const crocodilia = [_][]const u8{ "امریکی گڑیال", "آسٹریلیائ تازہ پانی کا گڑیال", "نیل گڑیال", "مشرقی افریقی گڑیال", "نمکین پانی کا گڑیال", "گڑیال" };

pub const insect = [_][]const u8{ "شہد کی مکھی", "مکھی", "چیونٹی" };

pub const lion = [_][]const u8{ "ایشیایْ شیر", "مشرقی افریقی شیر", "شمالی مغربی کانگو کا شیر" };

pub const @"type" = [_][]const u8{ "bear", "lion", "insect", "crocodilia", "cow" };
