pub const building_number = [_][]const u8{ "#####", "####", "###" };

pub const city_name = [_][]const u8{ "اسلام آباد", "پشاور", "لاہور", "کراچی", "ملتان", "نوشہرہ", "مردان", "چارسدہ", "گوجرنوالہ", "گجرات", "منگورہ", "ملاکنڈ", "درگیٗ", "حیدرآباد", "ایبٹ آباد", "ناران", "فیصل آباد", "راولپنڈی", "کوئٹہ", "بہاولپور", "سیالکوٹ", "لاڑکانہ", "رحیم یار خان", "قصُور", "اوکاڑا‎", "نواب شاہ", "چنیوٹ", "حافظ آباد", "کوھاٹ", "جہلم", "وارسک", "خانپور", "حب", "دسکہ", "خزدار", "مری", "گوجرہ", "دادو", "چشتیاں", "ٹیکسلا", "کبل", "گوٹکی", "نارو وال", "گوادر" };

pub const city_pattern = [_][]const u8{ "{{location.city_prefix}} {{person.first_name}}{{location.city_suffix}}", "{{location.city_prefix}} {{person.first_name}}", "{{person.first_name}}{{location.city_suffix}}", "{{person.last_name}}{{location.city_suffix}}", "{{location.city_name}}" };

pub const city_prefix = [_][]const u8{ "مشرق", "مغرب", "شمال", "جنوب", "نیا", "جھیل", "بندرگاہ" };

pub const city_suffix = [_][]const u8{"ٹاوْن"};

pub const country = [_][]const u8{ "افغانستان", "البانیا", "الجزایر", "امریکی سموا", "اندورہ", "انگولا", "انگویلیا", "انتارتیکا", "انتیگا اور باربئدا", "ارجنٹاینا", "ارمینیا", "اروبا", "آسٹریلیلا", "آسٹریا", "آزربایجان", "بہامس", "بہرین", "بنگلہ دیش", "باربادوس", "بیلاروس", "بیلجیم", "بیلیز", "بینن", "برمودہ", "بھوٹان", "بولویا", "بوسنیا و ہرزگووینیا", "بوسٹوانا", "برازیل", "برونوئ داراسلام", "بلغاریہ", "برونڈی", "کمبوڈیا", "کمروین", "کینیڈا", "سینٹرل افریقی ریاست", "چاڈ", "چلے", "چائنا", "کولمبیا", "کومورس", "کانگو", "کوسٹا ریکا", "کروایشیا", "کوبا", "چک ریاست", "ڈینمارک", "جبوتی", "ڈومینک ریاست", "اکواڈور", "مصر", "ال سلوادور", "ایرٹریا", "استونیا", "اتھوپیا", "فی جی", "فن لینڈ", "فرانس", "گابون", "گامبیہ", "جیورجیہ", "جرمنی", "گانا", "جبرالٹر", "یونان", "گام", "واتیکن", "ہونڈورس", "ہانگ کانگ", "ہنگری", "بھارت", "انڈونیشیا", "ایران", "عراق", "آئر لینڈ", "اٹلی", "جمائکہ", "جاپان", "اْردن", "کازخستان", "کینیا", "کریباتی", "شمالی ریاست کوریا", "جنوبی ریاست کوریا", "کویت", "لبنان", "مسیڈون", "مدگاسکر", "ملاوی", "ملائشیا", "مالدیپ", "مالی", "مالٹا", "میکسیکو", "منگولیہ", "مراکژ", "میانمار", "نیپال", "نیدرلینڈ", "نیوزیلینڈ", "نیکاراگوا", "نائجر", "نییجیریا", "ناروے", "اومان", "اسلامی جمہوریہ پاکستان", "پلاوؑ", "فلسطین", "پاناما", "پرو", "فلپائن", "پولینڈ", "پرتگال", "پورتو ریکو", "قطر", "رومانیہ", "روس", "روانڈا", "سموہ", "سان مرینو", "سعودیہ عربیہ", "سنیگال", "سربیا", "سے شیل", "سنگاپور", "سومالیہ", "جنوبی افرقہ", "ہسپانیہ", "سری لنکا", "سوڈان", "سری نامپ", "سوازی لینڈ", "سویڈن", "سوٹزرلینڈ", "شام", "تائوان", "تاجکستان", "تنزانیہ", "تھائ لینڈ", "ٹوگو", "ٹونگا", "ٹونیسیا", "ترکی", "ترکمانستان", "یوگانڈا", "یوکرین", "متحدہ عرب امارات", "متحدہ سلطنت", "متحدہ ریاست امریکا", "یوراگوائے", "اْزبکستان", "ونیزویلا", "وتنام", "یمن", "زمبیا", "زمبابوے" };

pub const default_country = [_][]const u8{"اسلامی جمہوریہ پاکستان"};

pub const direction = [_][]const u8{ "شمال", "مشرق", "جنوب", "مغرب", "شمال مشرق", "سمال مغرب", "جنوب مشرق", "جنوب مغرب" };

pub const postcode = [_][]const u8{"#####"};

pub const secondary_address = [_][]const u8{ "گھر. ###", "گلی ###" };

pub const state = [_][]const u8{ "خیبر پختونخواہ", "اسلام آباد", "پنجاب", "سندھ", "آزاد کشمیر", "بلوچستان", "گلگت بلتستان" };

pub const state_abbr = [_][]const u8{ "KP", "ICT", "J&K", "GB", "PB", "SD", "BA" };

pub const street_address = .{ .normal = "{{location.buildingNumber}} {{location.street}}", .full = "{{location.buildingNumber}} {{location.street}} {{location.secondaryAddress}}" };

pub const street_pattern = [_][]const u8{ "{{person.first_name}} {{location.street_suffix}}", "{{person.last_name}} {{location.street_suffix}}" };

pub const street_suffix = [_][]const u8{ "گاوْں", "گلی", "آباد", "کالونی", "گھڑی" };
