const NamePattern = @import("../../modules/person.zig").NamePattern;

pub const female_first_name = [_][]const u8{ "منایل", "عایشہ", "آمنہ", "عمائم", "خدیجہ", "حفصہ", "رابعہ", "اقدس", "حسنہ", "مریم", "حمیرہ", "وردہ", "شہناز", "نوشین", "مشال", "روبینہ", "روزینہ", "حدید" };

pub const female_prefix = [_][]const u8{ "محترمہ.", "ڈاکٹر" };

pub const first_name = [_][]const u8{ "منایل", "عایشہ", "آمنہ", "عمائم", "خدیجہ", "حفصہ", "رابعہ", "اقدس", "حسنہ", "مریم", "حمیرہ", "وردہ", "شہناز", "نوشین", "مشال", "روبینہ", "روزینہ", "حدید", "عمیر", "ابراہیم", "احسن", "عبداللہ", "عثمان", "حمزہ", "سیف", "ولید", "وسیم", "محسن", "یاسین", "کمال", "عادل", "اویس", "مسود", "شفیع", "فرہان", "ممتاز" };

pub const last_name = [_][]const u8{ "اعوان", "ملک", "جبران", "احمد", "علی", "خان", "جان", "آفریدی", "باجوڑی", "میمن", "راجپوت", "عبدالی", "نیازی", "شریف", "چوہدری", "ملوک", "اللَہ", "شنواری", "حسین", "الحق" };

pub const last_name_pattern = [_]NamePattern{.{ .value = "{{person.last_name}}", .weight = 1 }};

pub const male_first_name = [_][]const u8{ "عمیر", "ابراہیم", "احسن", "عبداللہ", "عثمان", "حمزہ", "سیف", "ولید", "وسیم", "محسن", "یاسین", "کمال", "عادل", "اویس", "مسود", "شفیع", "فرہان", "ممتاز" };

pub const male_prefix = [_][]const u8{ "محترم.", "ڈاکٹر" };

pub const name = [_]NamePattern{ .{ .value = "{{person.prefix}} {{person.firstName}} {{person.lastName}}", .weight = 1 }, .{ .value = "{{person.firstName}} {{person.lastName}} {{person.suffix}}", .weight = 1 }, .{ .value = "{{person.firstName}} {{person.lastName}}", .weight = 8 } };

pub const prefix = [_][]const u8{ "محترم.", "محترمہ.", "ڈاکٹر" };

pub const sex = [_][]const u8{ "عورت", "مرد" };

pub const suffix = [_][]const u8{ "چھوٹے", "بڑے", "پہل", "دوم", "سوم", "چہارم", "پنجم", "ششم", "هفتم", "نوئم", "دسم" };

pub const title = .{ .descriptor = [_][]const u8{ "سربراہ", "اعلیٰ", "مستقبل", "شہری", "ڈسٹرکٹ", "درمیانہ", "گلوبل", "گاہک", "بین ال اقوامی", "آگے", "اندرونی", "انسانی", "چیف", "پرنسپل" }, .level = [_][]const u8{ "حل", "پروگرام", "برانڈ", "سکیورٹی", "ریسرچ", "آگاہی", "حربہ", "شناخت", "بازار", "گروہ", "تقسیم", "استعمال", "بات چیت", "جال" } };
