pub const fuel = [_][]const u8{ "ديزل", "كهربائي", "بنزين", "هجين" };

pub const manufacturer = [_][]const u8{ "شيفروليه", "كاديلاك", "فورد", "كرايسلر", "دودج", "جيب", "تسلا", "تويوتا", "هوندا", "نيسان", "أودي", "مرسيدس بنز", "بي إم دبليو", "فولكس واجن", "بورش", "جاكوار", "استون مارتن", "لاند روفر", "بنتلي", "ميني", "رولزرويس", "فيات", "لامبورغيني", "مازيراتي", "فيراري", "بوجاتي", "كيا", "هيونداي" };

pub const model = [_][]const u8{ "فييستا", "التركيز", "الثور", "موستانج", "اكسبلورر", "البعثة", "نموذج T", "رانتشيرو", "فولت", "كروز", "ماليبو", "إمبالا", "كامارو", "كورفيت", "كولورادو", "سيلفرادو", "ش كامينو", "إسكاليد", "جبال الألب", "شاحن", "لو بارون", "بي تي كروزر", "تشالنجر", "دورانجو", "القافلة الكبرى", "رانجلر", "جراند شيروكي", "رودستر", "عارضات ازياء", "النموذج 3", "كامري", "بريوس", "لاند كروزر", "اتفاق", "المدنية", "جزء", "سنترا", "ألتيما", "خنفساء", "جيتا", "جولف", "سبايدر", "الكونتاش", "مورسيلاغو", "أفينتادور" };

pub const @"type" = [_][]const u8{ "كارغو فان", "مكشوفة", "كوبيه", "طاقم الكابينة بيك آب", "تمديد الكابينة بيك آب", "هاتشباك", "ميني فان", "سيارة الركاب", "سيارة رياضية", "سيدان", "عربة" };
