pub const city_pattern = [_][]const u8{ "{{location.city_prefix}}{{person.first_name}}{{location.city_suffix}}", "{{person.first_name}}{{location.city_suffix}}", "{{location.city_prefix}}{{person.last_name}}{{location.city_suffix}}", "{{person.last_name}}{{location.city_suffix}}" };

pub const city_prefix = [_][]const u8{ "北", "東", "西", "南", "新", "湖", "港" };

pub const city_suffix = [_][]const u8{ "市", "区", "町", "村" };

pub const country = [_][]const u8{ "アフガニスタン", "アルバニア", "アルジェリア", "アメリカ", "アンゴラ", "アルゼンチン", "オーストラリア", "オーストリア", "バハマ", "バーレーン", "バングラデシュ", "バルバドス", "ベルギー", "ベリーズ", "ブータン", "ボリビア", "ボスニヤ・", "ヘルツェゴビナ", "ボツワナ", "ブラジル", "ブルネイ", "ブルガリア", "カンボジア", "カメルーン", "カナダ", "中央アフリカ", "チャド", "チリ", "中国", "コロンビア", "コンゴ", "コスタリカ", "クロアチア", "キューバ", "キプロス", "チェコ", "デンマーク", "ドミニカ共和国", "エクアドル", "エジプト", "エルサルバドル", "赤道ギニア", "エストニア", "エチオピア", "フィジー", "フィンランド", "フランス", "ガンビア", "ドイツ", "ガーナ", "イギリス", "ギリシャ", "グリーンランド", "グレナダ", "グアテマラ", "ギニア", "ガイヤナ", "ハイチ", "オランダ", "ホンジェラス", "香港", "ハンガリー", "アイスランド", "インド", "インドネシア", "イラン", "イラク", "アイルランド", "イスラエル", "イタリア", "ジャマイカ", "日本", "ヨルダン", "ケニア", "コソボ", "クウェート", "ラオス", "ラトビア", "レバノン", "リベリア", "リビア", "リトアニア", "ルクセンブルク", "マカオ", "マダガスカル", "マラウィ", "マレーシア", "マルタ", "モルジブ", "モーリシャス", "メキシコ", "モルドバ", "モナコ", "モンゴル", "モロッコ", "モザンビーク", "ミャンマー", "ナミビア", "ネパール", "ニューギニア", "ニュージーランド", "ニカラグア", "ナイジェリア", "北朝鮮", "ノルウェー", "オーマン", "パキスタン", "パレスチナ", "パナマ", "パプアニューギニア", "パラグアイ", "ペルー", "フィリピン", "ポーランド", "ポルトガル", "カタール", "ルーマニア", "ロシア", "ルワンダ", "サウジアラビア", "スコットランド", "セネガル", "セイシェル", "シンガポール", "スロバキア", "スロベニア", "ソロモン諸島", "ソマリア", "南アフリカ", "韓国", "スペイン", "スリランカ", "スーダン", "スウェーデン", "スイス", "シリア", "タヒチ", "台湾", "タンザニア", "タイ", "トリニダード・トバゴ", "チュニジア", "トルコ", "ウガンダ", "ウクライナ", "アラブ首長国連邦", "ウルグアイ", "バチカン", "ベネズエラ", "ベトナム", "ウェールズ", "イエメン", "ザイール", "ザンビア", "ジンバブエ" };

pub const direction = [_][]const u8{ "北", "東", "南", "西", "北東", "北西", "南東", "南西" };

pub const postcode = [_][]const u8{"###-####"};

pub const state = [_][]const u8{ "北海道", "青森県", "岩手県", "宮城県", "秋田県", "山形県", "福島県", "茨城県", "栃木県", "群馬県", "埼玉県", "千葉県", "東京都", "神奈川県", "新潟県", "富山県", "石川県", "福井県", "山梨県", "長野県", "岐阜県", "静岡県", "愛知県", "三重県", "滋賀県", "京都府", "大阪府", "兵庫県", "奈良県", "和歌山県", "鳥取県", "島根県", "岡山県", "広島県", "山口県", "徳島県", "香川県", "愛媛県", "高知県", "福岡県", "佐賀県", "長崎県", "熊本県", "大分県", "宮崎県", "鹿児島県", "沖縄県" };

pub const state_abbr = [_][]const u8{ "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32", "33", "34", "35", "36", "37", "38", "39", "40", "41", "42", "43", "44", "45", "46", "47" };

pub const street_pattern = [_][]const u8{ "{{person.first_name}}{{location.street_suffix}}", "{{person.last_name}}{{location.street_suffix}}" };
