pub const fuel = [_][]const u8{ "دیزل", "الکتریکی", "بنزین", "هیبرید" };

pub const manufacturer = [_][]const u8{ "شورولت", "کادیلاک", "فورد", "کرایسلر", "دوج", "جیپ", "تسلا", "تویوتا", "هوندا", "نیسان", "آٔ‌ئودی", "مرسدس بنز", "بی ام و", "ولکس واگن", "پورشه", "جگوار", "استون مارتین", "لندرور", "بنتلی", "مینی", "رولز رویس", "فیات", "لامبورگینی", "مازراتی", "فراری", "بوگاتی", "کیا", "هیوندای" };

pub const model = [_][]const u8{ "فیستا", "فوکوس", "تاروس", "موستانگ", "اکسپلورر", "کروز", "مالیبو", "ایمپالا", "کامارو", "کروت", "کولورادو", "سیلورادو", "اسکالید", "آلپاین", "چارجر", "چلنجر", "رانگلر", "گرند چروکی", "رودستر", "کمری", "پریوس", "لندکروزر", "آکورد", "سیویک", "المنت", "سنترا", "آلتیما", "یبتل", "جتا", "گلف", "911", "اسپایدر", "کونتاچ", "مورسیه لاگو", "اونتادور" };

pub const @"type" = [_][]const u8{ "ون", "کوپه", "پیکاپ", "مینی ون", "ون مسافرتی", "شاسی بلند", "سدان", "استیشن" };
