pub const adjective = [_][]const u8{ "ބޮޑު", "ކުޑަ", "ހަޑި", "ރީތި", "ހޫނު", "ފިނި", "މަޖާ", "ފޫހި", "ހުތުރު", "އަލި", "އަނދިރި", "ހިރަފުސް", "ސާފު", "މޮޅު", "ދަށް", "ހުށިޔާރު", "ނުރައްކާ", "ސަމާލު", "ގޮތްކުޑަ", "ފުރިހަމަ", "އެއްވަނަ", "ދެވަނަ", "ތިންވަނަ", "ނުފެންނަ" };

pub const name_pattern = [_][]const u8{ "{{person.first_name}} {{company.suffix}}", "{{person.last_name}} {{company.suffix}}", "{{person.last_name}} & {{person.last_name}} {{company.noun}} {{company.suffix}}", "{{company.adjective}} {{company.noun}} {{company.suffix}}", "{{company.adjective}} {{person.last_name}} {{person.last_name}} {{company.suffix}}" };

pub const noun = [_][]const u8{ "ވަޑައިންގެ", "ހަރުގެ", "ގުދަން", "ގަރާޖު", "ކޮންޓެއިނަރު", "ބޮއްކުރާ", "ދޯނި", "ބައްރެލި", "މަނަވަރު", "މަތިންދާބޯޓު", "ހެލިކޮޕްޓަރު", "ރޮކެޓު", "ކަރުދާސް", "ފުޅި", "ބިއްލޫރި", "ހޮޅުއަށި", "ޕުލާސްޓިކު", "ފޮތި", "ދަގަނޑު", "ލަކުޑި", "ގޮނޑު", "ގޮނޑުދޮށް", "ރުއް", "ގަސް", "މޫ", "ބުޅާ", "ކަނބިލި", "މާކަނާ", "އިރުވާހުދު", "ރަތަފަ", "މާރަނގަ", "ހަރުފަ", "މަކުނު", "ކާޅު", "ކުކުޅު", "މަސް", "ގެރި", "ބަކަރި", "ފަރުމަސް", "ކަނޑުމަސް", "ބޮޑުމަސް", "ކުޑަމަސް", "ގޯތި", "މޫދު", "ކަނޑު", "ވިލު", "ފަޅު", "ގިރި", "ފެން", "ގަނޑުފެން", "މުރަނގަ", "ހިރުނދު", "ދިއްގާ", "ނިކަ", "މަގޫ", "އަތަ", "މޭވާ", "ތަރުކާރި" };

pub const suffix = [_][]const u8{ "ޕުރައިވެޓް ލިމިޓެޑް", ".ޕވޓ. ލޓޑ", "ޕަބްލިކް ލިމިޓެޑް", ".ޕބލކ. ލޓޑ", "ގުރޫޕް", "އޮފީސް" };
