pub const abbreviation = [_][]const u8{ "TCP", "HTTP", "SDD", "RAM", "GB", "CSS", "SSL", "AGP", "SQL", "FTP", "PCI", "AI", "ADP", "RSS", "XML", "EXE", "COM", "HDD", "THX", "SMTP", "SMS", "USB", "PNG", "SAS", "IB", "SCSI", "JSON", "XSS", "JBOD" };

pub const adjective = [_][]const u8{ "οδηγός", "πρωτογενής", "ψηφιακή", "ανοιχτή πηγή", "εικονική", "ασύρματο", "1080p", "οπτική", "κινητό" };

pub const noun = [_][]const u8{ "οδηγός", "πρωτόκολο", "ταχύτητα", "panel", "μικρότσιπ", "πρόγραμμα", "πόρτα", "κάρτα", "διεπαφή", "σύστημα", "σένσορας", "ασφάλεια", "σκληρός δίσκος", "feed", "οθόνη", "εφαρμογή", "δίαυλος", "διάγραμμα", "πυκνωτής", "πίνακας" };

pub const verb = [_][]const u8{ "back up", "bypass", "hack", "προσπέραση", "συμπίεση", "αντιγραφή", "περιήγηση", "σύνδεση", "υπολογισμός", "είσοδος", "μεταφορά", "πρόγραμμα", "επανεκκίνηση", "προσπέλαση" };
