pub const city_name = [_][]const u8{ "Αθήνα", "Θεσσαλονίκη", "Πειραιάς", "Πάτρα", "Ηράκλειο", "Λάρισα", "Βόλος", "Ιωάννινα", "Τρίκαλα", "Σέρρες", "Χαλκίδα", "Αλεξανδρούπολη", "Ξάνθη", "Κατερίνη", "Αγρίνιο", "Καλαμάτα", "Καβάλα", "Χανιά", "Λαμία", "Κομοτηνή", "Ρόδος", "Δράμα", "Βέροια", "Κοζάνη", "Καρδίτσα", "Ρέθυμνο", "Πτολεμαΐδα", "Τρίπολη", "Κόρινθος", "Γέρακας", "Γιαννιτσά", "Μυτιλήνη", "Χίος", "Σαλαμίνα", "Ελευσίνα", "Κέρκυρα", "Πύργος", "Μέγαρα", "Κιλκίς", "Θήβα", "Άργος", "Άρτα", "Άρτεμη", "Λιβαδειά", "Ωραιόκαστρο", "Αίγιο", "Κως", "Κορωπί", "Πρέβεζα", "Νάουσα", "Ορεστιάδα", "Έδεσσα", "Φλώρινα", "Αμαλιάδα", "Παλλήνη", "Σπάρτη", "Θέρμη", "Βάρη", "Νέα", "Αλεξάνδρεια", "Παιανία", "Καλύβια", "Ναύπλιο", "Ναύπακτος", "Καστοριά", "Γρεβενά", "Μεσολόγγι", "Γάζι", "Ιεράπετρα", "Κάλυμνος", "Ραφήνα", "Λουτράκι", "Άγιος", "Ερμούπολη", "Ιαλυσός", "Τύρναβος", "Γλυκά Νερά" };

pub const city_pattern = [_][]const u8{"{{location.city_name}}"};

pub const default_country = [_][]const u8{"Ελλάδα"};

pub const street_pattern = [_][]const u8{ "{{person.firstName}} {{location.street_suffix}}", "{{person.lastName}} {{location.street_suffix}}" };
